# 什么是 makefile?
make 是一个用于解释 makefile指令的命令工具。 使用 make 可以自动编译工程项目，提高软件开发效率。     
makefile 是工程的编译规则。高级语言的源文件通过编译链接等过程生成一个程序，但复杂工程中源文件不计其数， makefile 定义了一系列的规则来指定程序项目中源文件的编译顺序或进行更复杂的功能操作。make 命令执行时，需要一个 Makefile 文件，以告诉 make 命令需要怎么样的去编译和链接程序。

# makefile 示例
```
1）如果这个工程没有编译过，那么我们的所有C文件都要编译并被链接。
2）如果这个工程的某几个C文件被修改，那么我们只编译被修改的C文件，并链接目标程序。
3）如果这个工程的头文件被改变了，那么我们需要编译引用了这几个头文件的C文件，并链接目标程序。
```
# 语法规则  
```
target:prerequisites
    command
```

- target 即目标文件，支持中间目标文件、执行文件和标签。  
- prerequisites 即生成 target 所需要的文件或目标。  
- command 即 make 需要执行的命令。
    
target 目标文件依赖于 prerequisites 中的文件，其生成规则定义在 command 中。即 prerequisites 中任一文件比 target 文件新则执行 command 命令。
注：makefile 中以 <Tab> 为缩进，# 为注释。

# 工作原理
1. 执行 make 命令
2. make 在当前目录下查找文件名为 "Makefile" 或 "makefile" 的文件。  
3. 执行文件中的命令。存在目标文件则跳过，不存在则生成，存在但依赖文件更新则重新生成。  
4. make 一层一层地查找文件间的依赖关系，直至生成目标文件。   

# Makefile 组成
Makefile 由显示规则、隐晦规则、变量定义、文件指示和注释五部分组成。  
1. 显示规则：说明生成一个或多个目标文件(目标文件、依赖文件、执行命令)。  
2. 隐晦规则：利用自动推导功能简化书写。  
3. 变量定义：宏
4. 文件指示：Makefile 文件中引用另一 Makefile; 指定执行 Makefile 执行内容; 定义多行命令。  
5. 注释。Makefiel 中只有行注释，以`#`注释。  

# Makefile 赋值
|赋值|说明|  
|-|-|  
|=|最后赋值|  
|:=|覆盖之前的值|  
|?=|未赋值则赋值|  
|+=|添加后面值|  

# 伪目标
`.PHONY:clean`

